Documentacion/Mantenimientos/ER23_AP_Subir Complementos de Pagos/23012024 #150125 - MA178 Retención de proveedores incumplidos/Pruebas/SendPaymentsAPRq-Notifiacion_3.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<SendPaymentsAPRq xmlns="http://soa.estrellaroja.com.mx/ValidationPaymentsAPBiz" xmlns:client="http://xmlns.oracle.com/GER_SOA_DEV_OCI/ValidationPaymentsAPEnt/BpelSendPaymentsAP" xmlns:ns1="http://soa.estrellaroja.com.mx/ValidationPaymentsAPEnt" xmlns:ns2="http://soa.estrellaroja.com.mx/EstrellaRojaCommons" xmlns:ns3="http://soa.estrellaroja.com.mx/ValidationPaymentsAPBiz/types" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://soa.estrellaroja.com.mx/ValidationPaymentsAPBiz" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
			<ns0:DATA_DS xmlns:ns0="http://soa.estrellaroja.com.mx/Reports/XXER_ValidationComplement">
				<ns0:G_1>
					<ns0:ID_PAGO>7005423</ns0:ID_PAGO>
					<ns0:ID_CHECK>300000087344009</ns0:ID_CHECK>
					<ns0:CODIGO_TIPO_PAGO>EFT</ns0:CODIGO_TIPO_PAGO>
					<ns0:FECHA_PAGO>2023-09-01T00:00:00.000+00:00</ns0:FECHA_PAGO>
					<ns0:MONTO_PAGO>1158.05</ns0:MONTO_PAGO>
					<ns0:MONEDA_PAGO>MXN</ns0:MONEDA_PAGO>
					<ns0:NOMBRE_EMPRESA>TRATECSA_BU</ns0:NOMBRE_EMPRESA>
					<ns0:RFC_EMPRESA>TTE020806LF4</ns0:RFC_EMPRESA>
					<ns0:BANCO_EMPRESA>BANAMEX_7439</ns0:BANCO_EMPRESA>
					<ns0:NO_CTA_EMPRESA>0000000003747439</ns0:NO_CTA_EMPRESA>
					<ns0:NOMBRE_PROVEEDOR>GRUPO COMERCIAL DE MEXICO SA DE CV</ns0:NOMBRE_PROVEEDOR>
					<ns0:RFC_PROVEEDOR>GCM011227V7A</ns0:RFC_PROVEEDOR>
					<ns0:BANCO_PROVEEDOR>BANA1071</ns0:BANCO_PROVEEDOR>
					<ns0:NO_CTA_PROVEEDOR>002311001282381071</ns0:NO_CTA_PROVEEDOR>
					<ns0:EMAIL_NOTIFICACION>ana.alcantar@energeticosnieto.com,ana.romero@energeticosnieto.com,antonio.guzman@energeticosnieto.com,axel.olan@energeticosnieto.com,claudia.espinosa@energeticosnieto.com,diana.martinez@energeticosnieto.com,francisca.sanchez@energeticosnieto.com,jenny.romero@energeticosnieto.com,jesarely.medina@energeticosnieto.com,juan.torres@energeticosnieto.com,julian.rios@energeticosnieto.com,kimberly.perez@energeticosnieto.com,mariana.chavez@estrellaroja.com.mx,maru.rojas@energeticosnieto.com,ramon.ramirez@energeticosnieto.com,raul.garcia@energeticosnieto.com,yadira.woo@energeticosnieto.com</ns0:EMAIL_NOTIFICACION>
					<ns0:MENSAJE>2</ns0:MENSAJE>
					<ns0:NOMBRE_CARPETA>TRATECSA_BU_BANAMEX_7439</ns0:NOMBRE_CARPETA>
					<ns0:REFERENCE_NUMBER>104091</ns0:REFERENCE_NUMBER>
					<ns0:NUMERO_PAGO>911</ns0:NUMERO_PAGO>
					<ns0:ORGANIZATION_TYPE>CORPORATION</ns0:ORGANIZATION_TYPE>
					<ns0:PAYMENT_STATUS>CLEARED</ns0:PAYMENT_STATUS>
					<ns0:G_2>
						<ns0:ID_PAGO>7005423</ns0:ID_PAGO>
						<ns0:ID_FACTURA>300000086835947</ns0:ID_FACTURA>
						<ns0:NUMERO_PROVEEDOR>10247</ns0:NUMERO_PROVEEDOR>
						<ns0:NUMERO_DOCUMENTO>FEAT92208</ns0:NUMERO_DOCUMENTO>
						<ns0:MONTO_DOCUMENTO>1158.05</ns0:MONTO_DOCUMENTO>
						<ns0:RET_IVA>0</ns0:RET_IVA>
						<ns0:RET_ISR>0</ns0:RET_ISR>
						<ns0:TIPO_PAGO>STANDARD</ns0:TIPO_PAGO>
						<ns0:UNIDAD_NEGOCIO>TRATECSA_BU</ns0:UNIDAD_NEGOCIO>
					</ns0:G_2>
				</ns0:G_1>
			</ns0:DATA_DS>
		</SendPaymentsAPRq>
	</soap:Body>
</soap:Envelope>